
#Область ПрограммныйИнтерфейс

Функция ЗапуститьФоновоеВыполнение(ТекстПроцедуры, СтруктураПараметров=Неопределено) Экспорт
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
    ПараметрыВыполнения = Новый Массив;
    ПараметрыВыполнения.Добавить(ТекстПроцедуры);
    ПараметрыВыполнения.Добавить(СтруктураПараметров);
    
    ФоновыеЗадания.Выполнить("ИТФоновоеВыполнение.ФоноваяПроцедура", ПараметрыВыполнения, УникальныйИдентификатор);
	
    Возврат УникальныйИдентификатор;
	
КонецФункции

// Возвращаемое значение:
//  Булево - Истина = Рабочая
//
Функция ЭтоРабочаяБазаДанных() Экспорт
	
	ЭтоРабочая = Ложь;
	ИмяРабочей = "ZUP";

	ИмяСвоейБазы = Макс(НСтр(СтрокаСоединенияИнформационнойБазы(),"Ref"),НСтр(СтрокаСоединенияИнформационнойБазы(),"File"));	
    Если ВРег(ИмяСвоейБазы) = ИмяРабочей Тогда
	   ЭтоРабочая = Истина;
    КонецЕсли;
	
	Возврат ЭтоРабочая;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ФоноваяПроцедура(ТекстМодуля, ПараметрыВыполнения) Экспорт
	
	ПолныйТекстМодуля = "";
	
	Для Каждого ТекПараметр Из ПараметрыВыполнения Цикл
        ПолныйТекстМодуля = ПолныйТекстМодуля + ТекПараметр.Ключ+"=ПараметрыВыполнения."+ТекПараметр.Ключ+";"+Символы.ПС;
    КонецЦикла;
	
	ПолныйТекстМодуля = ПолныйТекстМодуля + ТекстМодуля;
	
	Выполнить(ПолныйТекстМодуля);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти
